raohassandev/esp32_firmware/boards/waveshare_esp32_s3_touch_lcd_5/screen/product_800x480/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
# ESP-IDF recommends PSRAM XIP for RGB bounce-buffer mode so flash writes do not
# disable the external-memory cache underneath display refill. Keep cache *size*
# memory-efficient: v6.0.1 documents that 16KB I-cache and 32KB D-cache return
# the remaining SRAM to heap. Bounce mode specifically requires a 64-byte D-cache
# line for stable PSRAM-to-SRAM refill bandwidth.
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y
CONFIG_ESP32S3_DATA_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
# Physical exact-board run of ec4fb846 proved that the old 4096-byte threshold
# let many ordinary Core/LVGL allocations consume scarce internal/DMA-capable
# memory: 135403 -> 101963 -> 1695 bytes across LCD reservation + Core startup.
# Keep only genuinely tiny mallocs biased to internal RAM; larger ordinary
# objects should prefer the board's 8 MB PSRAM. Code that truly requires
# internal/DMA memory must request those capabilities explicitly.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=512
# Reserve a larger internal DMA-capable pool for RGB bounce buffers, FreeRTOS
# task stacks and other explicit internal/DMA consumers. This does not create
# RAM; it prevents ordinary MALLOC_CAP_DEFAULT traffic from exhausting the pool
# before safety/control/recovery tasks are created. The exact-board requalification
# must prove the resulting steady-state headroom before this value is accepted.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=98304
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# The PSRAM Wi-Fi preference uses permanent DMA buffers. Exact-board diagnostics
# proved RX4/TX4 removes the four critical Core ESP_ERR_NO_MEM failures and the
# serial stall. BA8 equals 2x the static RX count, matching Espressif's window
# sizing rule while preserving AMPDU reception.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=4
CONFIG_ESP_WIFI_RX_BA_WIN=8
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# Keep automatic DMA restart disabled. It is a recovery mechanism that can make
# persistent bandwidth problems appear as visible recurring flicker instead of
# solving them; the new XIP/cache-line path must remain stable without it.
# CONFIG_LCD_RGB_RESTART_IN_VSYNC is not set
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=256
# Bench-only Waveshare provisioning. Remove before any production/customer build.
CONFIG_PVDG_PRIMARY_WIFI_SSID="Automatrix-4G"
CONFIG_PVDG_PRIMARY_WIFI_PASSWORD="Automatrix1234"
CONFIG_PVDG_APPLY_BUILD_WIFI_PROVISIONING=y
# BENCH CREDENTIAL PREFILL - REMOVE BEFORE PRODUCTION RELEASE.
# Prefills the Engineering credential on the Commission and Source pages so the
# bench operator does not retype it on every unlock. This string is compiled into
# the image and is public knowledge for any unit built from this source.
#
# Left EMPTY deliberately. The Engineering credential is NOT the Wi-Fi password,
# and it is not recoverable from this repository: engineering_auth reports
# "Engineering password is not configured" on a fresh unit and prints a one-time
# SETUP code to the serial console instead. Putting a guessed value here only
# produces "Engineering credential rejected" on the panel. Set this to the real
# bench password once, and it will be prefilled from then on.
CONFIG_WAVESHARE_BENCH_ENGINEERING_CREDENTIAL=""
CONFIG_PVDG_WIFI_PROVISION_ID=1
CONFIG_PVDG_DEFAULT_ZLAN_HOST="192.168.100.200"
CONFIG_FREERTOS_HZ=1000
CONFIG_MDNS_PREDEF_NETIF_STA=y
CONFIG_MDNS_PREDEF_NETIF_AP=y
CONFIG_MDNS_PREDEF_NETIF_ETH=n
CONFIG_MDNS_MAX_INTERFACES=2
CONFIG_MDNS_MAX_SERVICES=2

# Diagnostic only: lets the product report per-task stack high-water marks so
# support stacks can be right-sized from measurement instead of guesswork.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y

# LVGL allocates from the ESP heap, not from a fixed private pool.
#
# The Alarms page could not open and wedged the UI. The decoded watchdog
# backtrace ends in lv_obj_allocate_spec_attr, reached through lv_label_create
# from init_event_rows: LVGL was failing to allocate while building the page,
# not looping in layout.
#
# The cause was LV_USE_BUILTIN_MALLOC with LV_MEM_SIZE_KILOBYTES=64 and
# LV_MEM_POOL_EXPAND_SIZE_KILOBYTES=0 - a fixed 64 kB pool with expansion
# disabled. Every LVGL object on every lazily created page comes out of it, and
# Alarms alone adds 16 alarm rows and 16 event rows of several objects each, so
# by the time that page is opened the pool is exhausted and cannot grow.
#
# The C library allocator routes LVGL through the ESP heap instead, where the
# board's PSRAM is available, so widget memory is no longer capped at 64 kB and
# does not compete with the scarce internal DMA pool the RGB scanout needs.
CONFIG_LV_USE_BUILTIN_MALLOC=n
CONFIG_LV_USE_CLIB_MALLOC=y
